<a href="https://colab.research.google.com/github/HarshitaPandey08/AP/blob/master/09_06_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from numpy import random
print(random.randint(1,100))
print(random.rand())

94
0.9978244083439899

In [0]:
random.randint(100,size=(3))
random.randint(100,size=(3,4))
random.randint(100,size=(3,4,2))

array([[[55, 35],
        [25, 63],
        [20, 37],
        [91, 24]],

       [[13, 78],
        [95, 90],
        [14, 93],
        [84,  4]],

       [[17, 83],
        [ 9, 94],
        [64, 60],
        [62, 95]]])

In [0]:
print(random.rand())
print(random.rand(3))
print(random.rand(3,2))

0.02706423530975699
[0.74491773 0.9355136  0.60078317]
[[0.26791912 0.6399869 ]
 [0.06686959 0.7293392 ]
 [0.69953274 0.86839363]]

#####creating data frame
1. using 2 dictionaries
2. simple dictionary ----> data frame 
3. using series

In [0]:
import pandas as pd
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}  #all the keys are row indexes 'a','b'....

dict2={'a':5,'b':6,'c':7,'d':8,'e':9} 
data ={'first':dict1,'second':dict2}  #for giving names to columns 
df=pd.DataFrame(data,dtype=np.int32)
df

   first  second
a      1       5
b      2       6
c      3       7
d      4       8
e      5       9

In [0]:
d={'name':["harshita","pooja","manu"],'address':["hyd","jungle","vijaywada"]}
df1=pd.DataFrame(d)
df1

       name    address
0  harshita        hyd
1   pooja       jungle
2    manu    vijaywada

In [0]:
####using series 
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s2=pd.Series([12.23,11.05,14.05,15.06,16.30,17.80,18.9,19.01,13.69,20.36])
s3=pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data={'column1':s1,'column2':s2,'column3':s3}
df3=pd.DataFrame(data)
df3

   column1  column2 column3
0        1    12.23       a
1        2    11.05       b
2        3    14.05       c
3        4    15.06       d
4        5    16.30       e
5        6    17.80       f
6        7    18.90       g
7        8    19.01       h
8        9    13.69       i
9       10    20.36       j

In [0]:
df3[["column1","column3"]]

   column1 column3
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e
5        6       f
6        7       g
7        8       h
8        9       i
9       10       j

####selecting data from Data frame 
1. loc [row index:,column]  
2. iloc

In [0]:
df3.loc[:,"column1"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: column1, dtype: int64

In [0]:

df3.loc[0:5,["column1","column2"]]

   column1  column2
0        1    12.23
1        2    11.05
2        3    14.05
3        4    15.06
4        5    16.30
5        6    17.80

In [0]:
df3.iloc[:,0]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: column1, dtype: int64

In [0]:
df3.iloc[0:4,0:1]

   column1
0        1
1        2
2        3
3        4

####retrieving incormation  from data frame

In [0]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  10 non-null     int64
 1   column2  10 non-null     float64
 2   column3  10 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 368.0+ bytes

In [0]:
df3.shape

(10, 3)

In [0]:
df3.columns

Index(['column1', 'column2', 'column3'], dtype='object')

In [0]:
df3.index

RangeIndex(start=0, stop=10, step=1)

###viwing data from data frame
1. head()
2. tail()
3. sample()

In [0]:
###first 5 rows
df3.head()

   column1  column2 column3
0        1    12.23       a
1        2    11.05       b
2        3    14.05       c
3        4    15.06       d
4        5    16.30       e

In [0]:
df3.head(3)

   column1  column2 column3
0        1    12.23       a
1        2    11.05       b
2        3    14.05       c

In [0]:
df3.tail()

   column1  column2 column3
5        6    17.80       f
6        7    18.90       g
7        8    19.01       h
8        9    13.69       i
9       10    20.36       j

In [0]:
df3.sample()

   column1  column2 column3
6        7     18.9       g

In [0]:
df3.sample()

   column1  column2 column3
9       10    20.36       j

In [0]:
df3.describe()

        column1    column2
count  10.00000  10.000000
mean    5.50000  15.845000
std     3.02765   3.132394
min     1.00000  11.050000
25%     3.25000  13.780000
50%     5.50000  15.680000
75%     7.75000  18.625000
max    10.00000  20.360000